{
  "backend/main.mo": "Main actor defining groomer registration and service management with methods to register groomers, update services, and query groomer data, storing groomers in a Map with auto-incrementing IDs.",
  "backend/migration.mo": "Migration module that handles canister upgrades by preserving groomer data and initializing nextGroomerId from the existing groomers map size.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for groomer onboarding including routing, registration form, service management, Chewy blue styling, and React Query backend integration.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the scheduler page, groomer onboarding flow, hooks for backend integration, styling with Chewy blue theme, and sample data fallbacks.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, including standard UI tokens for background, foreground, borders, and semantic colors.",
  "frontend/index.html": "HTML entry point with root div and module script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with two routes (scheduler at / and groomer onboarding at /groomer-onboard) and rendering Toaster for notifications.",
  "frontend/src/components/onboarding/GroomerRegistrationForm.tsx": "Controlled form component collecting groomer profile data (name, email, phone, business name) with Chewy blue focus states and required field indicators.",
  "frontend/src/components/onboarding/ServiceManagementSection.tsx": "Service management component allowing add, edit, and delete operations for service entries with inline editing, validation, and Chewy blue styled buttons.",
  "frontend/src/components/scheduler/BookNowModal.tsx": "Modal dialog component for booking grooming appointments that displays service details, allows date selection, and handles appointment confirmation with validation.",
  "frontend/src/components/scheduler/GroomerSelectList.tsx": "Displays a grid of groomer cards with photos, ratings, descriptions, and service counts, handling loading states, errors, and click-to-select interactions.",
  "frontend/src/components/scheduler/ServiceList.tsx": "Lists grooming services with details, pricing, and booking buttons; integrates BookNowModal and shows toast notifications on successful appointment scheduling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useGroomers.ts": "React Query hook that fetches all groomers from backend, enriches them with photos and descriptions, and gracefully falls back to sample data on errors or empty results.",
  "frontend/src/hooks/useGroomerServices.ts": "React Query hook that fetches services for a specific groomer, falling back to sample data for groomers with IDs 1-3.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useRegisterGroomer.ts": "React Query mutation hook for registering a new groomer with name and services, invalidating the groomers query cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system including light/dark themes, color tokens (primary, secondary, destructive, etc.), and a custom 'chewy' brand color scheme using OKLCH color space.",
  "frontend/src/lib/groomerDescriptionCatalog.ts": "Provides descriptive text for groomers by ID with predefined descriptions for groomers 1-4 and deterministic fallback descriptions for any other groomer IDs.",
  "frontend/src/lib/groomerPhotoCatalog.ts": "Maps groomer IDs to local pet photo assets (640x360 JPGs) with alt text, providing a lookup function to retrieve photos for display.",
  "frontend/src/lib/sampleGroomers.ts": "Defines sample groomer data with three groomers (Happy Paws, Furry Friends Spa, Pampered Pets) each containing multiple services with titles, descriptions, and price ranges for initial app state.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/GroomerOnboardPage.tsx": "Multi-step groomer registration page with form for business details and service management, handling submission via useRegisterGroomer hook and displaying success state with navigation options.",
  "frontend/src/pages/GroomerSchedulerPage.tsx": "Main scheduler page displaying groomer selection list and service details, with fallback handling for backend errors, navigation to onboarding, and two-step UI flow (select groomer, then view services).",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom color system using OKLCH values, container settings, border radius variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking a pet groomer scheduler application with Chewy-inspired UI, including groomer selection, service booking, and onboarding flows. Currently at version 17 with known issues around Chewy blue styling not applying correctly and groomer list failing to load."
}